_posts/jams/procjam/2014-11-08-entering-procjam-2014.html
---
layout: post
title: "Entering PROCJAM 2014"
categories: [jams, procjam]
---

<p>
This weekend a new game jam called <a href="http://itch.io/jam/procjam">PROCJAM</a> begins.  The goal is to
create a game or tools that can generate content procedurally.  I've
been experimenting with <a href="http://clojure.org/">Clojure</a>, <a href="http://quil.info/">Quil</a>, and <a href="http://overtone.github.io/">Overtone</a> lately, so a game
with procedural world and music generation seemed to be a great
project.  I decided to enter this jam and enlisted my friend <a href="http://alexmorais.com/">Alex</a> to
help me.
</p>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">So what are we making?</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Our plan is to develop a simple semi-<a href="http://en.wikipedia.org/wiki/Roguelike">roguelike</a>, atmospheric platformer
that takes a lot of inspiration from Nifflas' classic game <a href="http://nifflas.ni2.se/?page=Knytt">Knytt</a>.  The
plan is to have a new procedurally generated world each playthrough
with music that is always unique and driven by the actions of the
player.  We are using the roguelike design principle of <a href="http://en.wikipedia.org/wiki/Permanent_death">permadeath</a> so
that once you die, you must start over in a newly generated world.
This is reminiscent of the recent game <a href="http://www.roguelegacy.com/">Rogue Legacy</a>.  Since neither of
us are artists, we will be using primitive shapes for the graphics in
this game.  Hopefully keeping things abstract will still allow for an
interesting experience.
</p>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">The game is called "Kleffs," or "How I Learned to Stop Worrying and Love the Randomness"</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
You play the role of a being named Kleff who lives in a world that is
held together by musical harmony.  The chaotic force Dissonance has
taken important musical artifacts and scattered them around the world
to throw harmony out of balance.  Kleff is called to retrieve these
artifacts to restore harmony and save the world from destruction.  We
call the game <b>Kleffs</b> because it seems that there are infinite
Kleffs; when one dies, another rises to carry on the mission.
</p>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Can we have some more hours, please?</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
PROCJAM is running for a little over a week (Friday the 8th to Monday
the 17th) so there is a generous amount of time to work on this
project.  Unfortunately both Alex and I have family obligations so we
can't spend many hours coding.  Our goal is to do as much as we can to
create a playable prototype of the concept by the end of the jam.  From
there we may continue working on it to complete the game.
</p>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-2">
<h2 id="unnumbered-4">I will tell and show you things.  Hopefully.</h2>
<div class="outline-text-2" id="text-unnumbered-4">
<p>
I will be posting short updates on <a href="http://twitter.com/daviwil">Twitter</a> this week as we work on the
game.  We are working on the visuals first so hopefully we will have
some nice screenshots to share soon.  Once we get procedural music
into the game, I may post a video demonstration.  The code is being
developed openly and you can see what little (oh so little) we have so
far at our <a href="http://github.com/daviwil/kleffs">GitHub repository</a>.
</p>
</div>
</div>
